app/controllers/api/events_controller.rb

  def create
    registered_application = RegisteredApplication.find_by(url: request.env['HTTP_ORIGIN'])

    if registered_application.nil?
      render json: "Unregistered application", status: :unprocessable_entity
    else
      @event = registered_application.events.build(event_params)
        if @event.save
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."url" = ? LIMIT ?  [["url", "http://registered_application.com"], ["LIMIT", 1]]
INSERT INTO "events" ("event_name", "registered_application_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_name", "about page loaded"], ["registered_application_id", 69], ["created_at", "2018-07-15 20:29:40.839662"], ["updated_at", "2018-07-15 20:29:40.839662"]]