app/controllers/api/events_controller.rb

  def create
    registered_application = RegisteredApplication.find_by(registration: request.env['HTTP_ORIGIN'])
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."registration" = ? LIMIT ?  [["registration", "https://quiet-meadow-88838.herokuapp.com"], ["LIMIT", 1]]