app/views/registered_applications/show.html.erb

  <div class="col-md-4">
     <%= pie_chart @registered_application.events.group(:event_name).count %>
---
SELECT "events".* FROM "events" WHERE "events"."registered_application_id" = ?  [["registered_application_id", 9]]
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d 00:00:00 UTC', created_at) AS strftime_y_m_d_00_00_00_utc_created_at FROM "events" WHERE "events"."registered_application_id" = ? AND (created_at IS NOT NULL) GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', created_at)  [["registered_application_id", 5]]