app/controllers/registered_applications_controller.rb

  def show
    @registered_application = RegisteredApplication.find(params[:id])
    @events = @registered_application.events.group_by(&:event_name)
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."registered_application_id" = ?  [["registered_application_id", 9]]

  def create
    @registered_application = RegisteredApplication.new(app_params)
    @registered_application.user = current_user

    if @registered_application.save
---
INSERT INTO "registered_applications" ("registration", "app_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @registered_application = RegisteredApplication.find(params[:id])
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @registered_application = RegisteredApplication.find(params[:id])
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @registered_application = RegisteredApplication.find(params[:id])

    if @registered_application.destroy
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "registered_applications" WHERE "registered_applications"."id" = ?  [["id", 1]]