app/controllers/welcome_controller.rb

  def index
    @sample_app = RegisteredApplication.all.sample
    @events = @sample_app.events.group_by(&:event_name)
---
SELECT "registered_applications".* FROM "registered_applications"
SELECT "events".* FROM "events" WHERE "events"."registered_application_id" = ?  [["registered_application_id", 72]]